import math

BLACK = "#000000"  # Цвет линий объекта (чёрный)
BLUE = "#0D52BF"  # Цвет оси ординат (синий)
C = -0.01  # Центр проецирования
GREEN = "#3A9104"  # Цвет оси аппликат (зелёный)
K = (math.pi / 180) * 45  # Градус проецирования
HEIGHT = 500  # Высота рендера
MOVE = 10  # Шаг перемещения
PANEL_WIDTH = 120  # Ширина панели управления
RED = "#A10705"  # Цвет оси абсцисс (красный)
SCALE = 0.125  # Шаг масштаба
TITLE = "Аффинные преобразования"  # Заголовок
TURN = 10  # Шаг поворота
WHEAT = "#F5DEB3"  # Цвет полотна (пшеничный)
WIDTH = 700  # Ширина рендера
