import math

#   Константы
MOVE = 10                   # Шаг перемещения
TURN = 10                   # Шаг поворота
SCALE = 0.125               # Шаг масштаба
WIDTH = 700                 # Ширина рендера
HEIGHT = 500                # Высота рендера
PANEL = 120                 # Ширина панели управления
PROJECTION = [0, 1]         # Текущий тип проецирования
C = -0.01                   # Центр проецирования
RADIANS = math.pi / 180     # Радианы
K = RADIANS * 45            # Градус проецирования
AXIS = ['X', 'Y', 'Z']      # Оси
WHEAT = '#F5DEB3'           # Пшеничный цвет
BLACK = '#000000'           # Чёрный цвет
RED = '#A10705'             # Красный цвет
BLUE = '#0D52BF'            # Синий цвет
GREEN = '#3A9104'           # Зелёный цвет
